{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "config.DATABASE_URL = \"neo4j://neo4j:yfy12345@138.3.214.21:7687\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "delete all nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "All data has been deleted from the Neo4j database.\n"
     ]
    }
   ],
   "source": [
    "def clear_all_nodes(db):\n",
    "    delete_query = \"MATCH (n) DETACH DELETE n\"\n",
    "\n",
    "    db.cypher_query(delete_query)\n",
    "\n",
    "    print(\"All data has been deleted from the Neo4j database.\")\n",
    "clear_all_nodes(db)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "check current nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def check_all_nodes(db):\n",
    "    query = \"\"\"\n",
    "    MATCH (a)-[r]-(b)\n",
    "    RETURN a, r, b\n",
    "    \"\"\"\n",
    "\n",
    "    cypher_results, meta = db.cypher_query(query)\n",
    "    if cypher_results:\n",
    "        results_as_dict = [dict(zip(meta, row)) for row in cypher_results]\n",
    "        return results_as_dict\n",
    "    else:\n",
    "        return None\n",
    "    \n",
    "\n",
    "results_as_dict = check_all_nodes(db)\n",
    "results_as_dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def check_join_table_nodes_and_relationships(db, tabletype):\n",
    "    query = f\"\"\"\n",
    "    MATCH (a:{tabletype})-[r]-(b)\n",
    "    RETURN a, r, b\n",
    "    \"\"\"\n",
    "    \n",
    "    cypher_results, meta = db.cypher_query(query)\n",
    "    if cypher_results:\n",
    "        # Return results as a list of dictionaries containing nodes and relationships\n",
    "        results_as_dict = [dict(zip(meta, row)) for row in cypher_results]\n",
    "        return results_as_dict\n",
    "    else:\n",
    "        return None\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "None\n"
     ]
    }
   ],
   "source": [
    "results_as_dict = check_join_table_nodes_and_relationships(db, 'SourceTable')\n",
    "print(results_as_dict)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Read data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>view_name</th>\n",
       "      <th>text</th>\n",
       "      <th>input</th>\n",
       "      <th>lineage</th>\n",
       "      <th>llm_fixed_lineage</th>\n",
       "      <th>format_fixed_lineage</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C$_0W_YFY_AV_TW_R</td>\n",
       "      <td>select \"C1_ROW_ID\",\"C2_ORG_ID\",\"C3_REF_AV_HEAD...</td>\n",
       "      <td>select \"C1_ROW_ID\",\"C2_ORG_ID\",\"C3_REF_AV_HEAD...</td>\n",
       "      <td>{\\n    \"Datasource\": ['ODS.W_YFY_AV_TW_R']\\n}</td>\n",
       "      <td>{\\n    \"Datasource\": [\"ODS.W_YFY_AV_TW_R\"]\\n}</td>\n",
       "      <td>{ \"Datasource\": [\"ODS.W_YFY_AV_TW_R\"]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C$_0W_YFY_IND_FIN_INFO_FS</td>\n",
       "      <td>select   FIN_INFO.SEQ    C1_SEQ,  FIN_INFO.ACC...</td>\n",
       "      <td>select   FIN_INFO.SEQ    C1_SEQ,  FIN_INFO.ACC...</td>\n",
       "      <td>{\\n    \"Datasource\": ['ODS.TC$_0W_YFY_IND_FIN_...</td>\n",
       "      <td>{\\n    \"Datasource\": [\"ODS.TC$_0W_YFY_IND_FIN_...</td>\n",
       "      <td>{ \"Datasource\": [\"ODS.TC$_0W_YFY_IND_FIN_INFO_...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>OP_FACT_CHP_INVENTORY_ETH_PULP</td>\n",
       "      <td>SELECT PERIOD_NAME,STOCK_DATE TDATE,ORG_CODE,'...</td>\n",
       "      <td>SELECT PERIOD_NAME,STOCK_DATE TDATE,ORG_CODE,'...</td>\n",
       "      <td>{\\n    \"Union1\": {\\n        \"Datasource\": ['W_...</td>\n",
       "      <td>{\\n    \"Union1\": {\\n        \"Datasource\": [\"W_...</td>\n",
       "      <td>{ \"Union1\": { \"Datasource\": [\"W_FACTORY_INV_BA...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>OP_FACT_CHP_INVENTORY_REDEFINE</td>\n",
       "      <td>SELECT PERIOD_NAME,TDATE,ORG_CODE   ,CASE ORG_...</td>\n",
       "      <td>SELECT PERIOD_NAME,TDATE,ORG_CODE   ,CASE ORG_...</td>\n",
       "      <td>{\\n    \"Union1\": {\\n        \"Datasource\": [\"W_...</td>\n",
       "      <td>nochange</td>\n",
       "      <td>{ \"Union1\": { \"Datasource\": [\"W_YFY_INV_BALANC...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>OP_FACT_CHP_SALES_DETAILS</td>\n",
       "      <td>SELECT      '當月受訂' TYPE,     --GREATEST(F.REQU...</td>\n",
       "      <td>SELECT      '當月受訂' TYPE,     --GREATEST(F.REQU...</td>\n",
       "      <td>{\\n    \"Union1\": {\\n        \"Datasource\": ['W_...</td>\n",
       "      <td>{\\n    \"Union1\": {\\n        \"Datasource\": [\"W_...</td>\n",
       "      <td>{ \"Union1\": { \"Datasource\": [\"W_CHP_SALES_NOMA...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        view_name  \\\n",
       "0               C$_0W_YFY_AV_TW_R   \n",
       "1       C$_0W_YFY_IND_FIN_INFO_FS   \n",
       "2  OP_FACT_CHP_INVENTORY_ETH_PULP   \n",
       "3  OP_FACT_CHP_INVENTORY_REDEFINE   \n",
       "4       OP_FACT_CHP_SALES_DETAILS   \n",
       "\n",
       "                                                text  \\\n",
       "0  select \"C1_ROW_ID\",\"C2_ORG_ID\",\"C3_REF_AV_HEAD...   \n",
       "1  select   FIN_INFO.SEQ    C1_SEQ,  FIN_INFO.ACC...   \n",
       "2  SELECT PERIOD_NAME,STOCK_DATE TDATE,ORG_CODE,'...   \n",
       "3  SELECT PERIOD_NAME,TDATE,ORG_CODE   ,CASE ORG_...   \n",
       "4  SELECT      '當月受訂' TYPE,     --GREATEST(F.REQU...   \n",
       "\n",
       "                                               input  \\\n",
       "0  select \"C1_ROW_ID\",\"C2_ORG_ID\",\"C3_REF_AV_HEAD...   \n",
       "1  select   FIN_INFO.SEQ    C1_SEQ,  FIN_INFO.ACC...   \n",
       "2  SELECT PERIOD_NAME,STOCK_DATE TDATE,ORG_CODE,'...   \n",
       "3  SELECT PERIOD_NAME,TDATE,ORG_CODE   ,CASE ORG_...   \n",
       "4  SELECT      '當月受訂' TYPE,     --GREATEST(F.REQU...   \n",
       "\n",
       "                                             lineage  \\\n",
       "0      {\\n    \"Datasource\": ['ODS.W_YFY_AV_TW_R']\\n}   \n",
       "1  {\\n    \"Datasource\": ['ODS.TC$_0W_YFY_IND_FIN_...   \n",
       "2  {\\n    \"Union1\": {\\n        \"Datasource\": ['W_...   \n",
       "3  {\\n    \"Union1\": {\\n        \"Datasource\": [\"W_...   \n",
       "4  {\\n    \"Union1\": {\\n        \"Datasource\": ['W_...   \n",
       "\n",
       "                                   llm_fixed_lineage  \\\n",
       "0      {\\n    \"Datasource\": [\"ODS.W_YFY_AV_TW_R\"]\\n}   \n",
       "1  {\\n    \"Datasource\": [\"ODS.TC$_0W_YFY_IND_FIN_...   \n",
       "2  {\\n    \"Union1\": {\\n        \"Datasource\": [\"W_...   \n",
       "3                                           nochange   \n",
       "4  {\\n    \"Union1\": {\\n        \"Datasource\": [\"W_...   \n",
       "\n",
       "                                format_fixed_lineage  \n",
       "0             { \"Datasource\": [\"ODS.W_YFY_AV_TW_R\"]}  \n",
       "1  { \"Datasource\": [\"ODS.TC$_0W_YFY_IND_FIN_INFO_...  \n",
       "2  { \"Union1\": { \"Datasource\": [\"W_FACTORY_INV_BA...  \n",
       "3  { \"Union1\": { \"Datasource\": [\"W_YFY_INV_BALANC...  \n",
       "4  { \"Union1\": { \"Datasource\": [\"W_CHP_SALES_NOMA...  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "bidb_view = pd.read_csv('./result/reformated_datasource.csv')\n",
    "bidb_view"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'{ \"Union1\": { \"Datasource\": [\"W_FACTORY_INV_BALANCE_F\"] }, \"Union2\": { \"Datasource\": [\"W_FACTORY_INV_F\"] }}'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "bidb_view.iloc[2].format_fixed_lineage"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "view_name = bidb_view.iloc[3].view_name\n",
    "syntax = bidb_view.iloc[3].text\n",
    "test_string = bidb_view.iloc[3].format_fixed_lineage\n",
    "test_dict = json.loads(test_string)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Datasource': ['W_YFY_INV_BALANCE_F',\n",
       "  'w_chp_item_d',\n",
       "  'W_YFY_ORG_D',\n",
       "  'W_CHP_TS_BELONG_ORG_R']}"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# select the first element in the dictionary\n",
    "chunk_key = next(iter(test_dict))\n",
    "chunk_value = test_dict[chunk_key]\n",
    "chunk_value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_node(table_name, table_type):\n",
    "    \"\"\"\n",
    "    Check if the table name belongs to the table_type and return it if it exists.\n",
    "    Create it if it does not exist.\n",
    "    \"\"\"\n",
    "    # Use getattr to dynamically access the class\n",
    "    table_class = globals().get(table_type)\n",
    "    \n",
    "    if table_class:  # Ensure the class exists\n",
    "        table = table_class.nodes.get_or_none(name=table_name)\n",
    "        if table:\n",
    "            return table\n",
    "        else:\n",
    "            return table_class(name=table_name, filter=[], join_condition=[]).save()\n",
    "    else:\n",
    "        raise ValueError(f\"Unknown table type: {table_type}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "#TODO: write as a function, the input are datasource_list, filter_list, join_list, groupby_dict\n",
    "\n",
    "datasource_list = chunk_value['Datasource']\n",
    "# filter_list = chunk_value['Filter']\n",
    "# join_list = chunk_value['Join']\n",
    "# groupby_dict = chunk_value['Groupby']\n",
    "\n",
    "\n",
    "\n",
    "# the join_list function \n",
    "\n",
    "def creage_join_table_graph(join_list):\n",
    "    for join_rel in join_list:\n",
    "        # creat join node\n",
    "        parent_list = [table for table in datasource_list if table in join_rel]\n",
    "        join_result_name = str(parent_list[0]) + \" Join \" + str(parent_list[1])\n",
    "\n",
    "        # get the filter which comes from the same parent table\n",
    "        join_result_node = get_node(join_result_name, 'JoinTable')\n",
    "\n",
    "    \n",
    "        # check if the join relationship is existed\n",
    "        if join_result_node.join_condition == None or join_rel not in join_result_node.join_condition:\n",
    "            # put all the join condition in the jointable node\n",
    "            join_result_node.join_condition.append(join_rel)\n",
    "            join_result_node.save()\n",
    "\n",
    "        # create source table nodes\n",
    "        joined_source_1_name = parent_list[0]\n",
    "        joined_source_1_node = get_node(joined_source_1_name, 'SourceTable')\n",
    "        joined_source_2_name = parent_list[1]\n",
    "        joined_source_2_node = get_node(joined_source_2_name, 'SourceTable')\n",
    "\n",
    "        # store the join condition in relationship\n",
    "        join_source = [\n",
    "            (joined_source_1_name, joined_source_1_node),\n",
    "            (joined_source_2_name, joined_source_2_node)\n",
    "        ]\n",
    "\n",
    "        for source_name,  source_node in join_source:\n",
    "            if source_name in join_rel:\n",
    "                join_result_node.join_from_base.connect(source_node, {'from_join': join_rel})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "#TODO: write the function for creating datasource node from datasource_list \n",
    "\n",
    "def create_view_data_source(view_name, datasource_list):\n",
    "    # create view node\n",
    "    view_node = get_node(view_name, 'View')\n",
    "    view_node.syntax = syntax\n",
    "    view_node.save()\n",
    "\n",
    "    # create table node\n",
    "    for table_name in datasource_list:\n",
    "        table_node = get_node(table_name, 'SourceTable')  \n",
    "        \n",
    "        view_node.is_parent_from.connect(table_node)\n",
    "        table_node.child_to_view.connect(view_node)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Desconstruct all of the LLM result\n",
    "def result_destructure(view_name, input_string):\n",
    "    # convert to dict\n",
    "    input_dict = json.loads(input_string)\n",
    "\n",
    "\n",
    "    # Convert the dictionary keys to a pandas Series\n",
    "    keys_series = pd.Series(input_dict.keys())\n",
    "\n",
    "    if keys_series.str.contains('Union').any():\n",
    "    \n",
    "        for _, vlaue in input_dict.items():\n",
    "            \n",
    "            datasource_list = vlaue['Datasource']\n",
    "            # filter_list = vlaue['Filter']\n",
    "            # join_list = vlaue['Join']\n",
    "            # groupby_dict = vlaue['Groupby']\n",
    "        \n",
    "            # here we call the function for desconstructing join_list, datasource_list, filter_list, groupby_dict\n",
    "            create_view_data_source(view_name, datasource_list)\n",
    "\n",
    "    else:\n",
    "        datasource_list = input_dict['Datasource']\n",
    "        # filter_list = input_dict['Filter']\n",
    "        # join_list = input_dict['Join']\n",
    "        # groupby_dict = input_dict['Groupby']\n",
    "\n",
    "        create_view_data_source(view_name, datasource_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "extracted_lineage = {}\n",
    "for idx, row in bidb_view.iterrows():\n",
    "    \n",
    "    result_destructure(row.view_name, row.format_fixed_lineage)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Union1\n",
       "1    Union2\n",
       "2    Union3\n",
       "dtype: object"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Load the JSON from the column\n",
    "json_data = json.loads(row.format_fixed_lineage)\n",
    "\n",
    "# Convert the dictionary keys to a pandas Series\n",
    "keys_series = pd.Series(json_data.keys())\n",
    "\n",
    "# Use .str.contains() to filter keys that contain 'Union'\n",
    "union_keys = keys_series[keys_series.str.contains('Union')]\n",
    "union_keys"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'{ \"Datasource\": [\"ODS.W_YFY_AV_TW_R\"], \"Filter\": [], \"Join\": [], \"Groupby\": {}}'"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "row.fixed_lineage_2"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "bibot",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
